<a href="https://colab.research.google.com/github/Juniorexz/Codigo/blob/master/Curso_Python_Pandas_Digital_Innovation_Planilhasexcel.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#Importando a biblioteca
import pandas as pd

In [2]:
#Leitura dos arquivos
df1 = pd.read_excel("Aracaju.xlsx")
df2 = pd.read_excel("Fortaleza.xlsx")
df3 = pd.read_excel("Natal.xlsx")
df4 = pd.read_excel("Recife.xlsx")
df5 = pd.read_excel("Salvador.xlsx")

In [3]:
df5.head()

     Cidade       Data  Vendas  LojaID  Qtde
0  Salvador 2018-01-01   31.06    1037     3
1  Salvador 2018-01-01   19.02    1034     3
2  Salvador 2019-02-10  173.59    1035     3
3  Salvador 2019-02-10  176.34    1037     3
4  Salvador 2019-02-14   19.47    1037     3

In [4]:
#juntando todos os arquivos
df = pd.concat([df1,df2,df3,df4,df5])

In [5]:
#Exibindo as 5 primeiras linhas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [6]:
#Exibindo as 5 últimas linhas
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [7]:
df.sample(5)

        Cidade       Data  Vendas  LojaID  Qtde
197      Natal 2019-01-02   10.45    1036     2
184      Natal 2019-01-02  167.16    1037     1
121     Recife 2019-03-02   41.55     981     3
70      Recife 2019-01-01   20.40     983     7
76   Fortaleza 2019-01-01   38.61    1004     4

In [8]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [9]:
#Alterando o tipo de dado da coluna LojaID
df["LojaID"] = df["LojaID"].astype("object")

In [10]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [11]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

In [12]:
#Consultando linhas com valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [13]:
#Substituindo os valores nulos pela média
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

In [14]:
df["Vendas"].mean()

122.61180089485438

In [15]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [16]:
df.sample(15)

        Cidade       Data  Vendas LojaID  Qtde
76    Salvador 2019-01-01   39.51   1035     3
106    Aracaju 2018-01-01   16.32   1520     7
39   Fortaleza 2019-01-01  176.51   1005     1
71      Recife 2019-01-01  138.69    983     3
166   Salvador 2019-01-02  111.72   1035     3
36       Natal 2019-02-09  328.00    853     2
76   Fortaleza 2019-01-01   38.61   1004     4
124      Natal 2019-01-02   44.82   1034     3
69     Aracaju 2018-01-01   15.81   1523     1
82   Fortaleza 2019-01-01   14.03   1004     5
78      Recife 2019-01-01  238.73    980     3
196   Salvador 2019-01-02  145.09   1036     2
80      Recife 2019-01-01  114.14    982     8
154      Natal 2019-01-02    9.58   1037     1
52    Salvador 2019-01-01   43.77   1036     2

In [17]:
#Substituindo os valores nulos por zero
df["Vendas"].fillna(0, inplace=True)

In [18]:
#Apagando as linhas com valores nulos
df.dropna(inplace=True)

In [19]:
#Apagando as linhas com valores nulos com base apenas em 1 coluna
df.dropna(subset=["Vendas"], inplace=True)

In [20]:
#Removendo linhas que estejam com valores faltantes em todas as colunas
df.dropna(how="all", inplace=True)

In [21]:
#Criando a coluna de receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [22]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [23]:
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]

In [24]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [25]:
#Retornando a maior receita
df["Receita"].max()

3544.0

In [26]:
#Retornando a menor receita
df["Receita"].min()

3.34

In [27]:
#nlargest
df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0

In [28]:
#nsamllest
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [29]:
#Agrupamento por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [31]:
#Ordenando o conjunto de dados
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0

In [32]:
#Transformando a coluna de data em tipo inteiro
df["Data"] = df["Data"].astype("int64")

In [33]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade             object
Data                int64
Vendas            float64
LojaID             object
Qtde                int64
Receita           float64
Receita/Vendas    float64
dtype: object

In [34]:
#Transformando coluna de data em data
df["Data"] = pd.to_datetime(df["Data"])

In [35]:
df.dtypes

Cidade                    object
Data              datetime64[ns]
Vendas                   float64
LojaID                    object
Qtde                       int64
Receita                  float64
Receita/Vendas           float64
dtype: object

In [37]:
#Agrupamento por ano
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [38]:
#Criando uma nova coluna com o ano
df["Ano_Venda"] = df["Data"].dt.year

In [39]:
df.sample(5)

       Cidade       Data  Vendas  ...  Receita  Receita/Vendas  Ano_Venda
77      Natal 2019-04-01  426.00  ...  1278.00             3.0       2019
47  Fortaleza 2019-01-01   13.45  ...    67.25             5.0       2019
30     Recife 2019-01-01   12.35  ...    61.75             5.0       2019
82      Natal 2019-03-07  868.00  ...  2604.00             3.0       2019
56     Recife 2019-01-01    7.98  ...    39.90             5.0       2019

[5 rows x 8 columns]

In [40]:
#Extraindo o mês e o dia
df["mes_venda"], df["dia_venda"] = (df["Data"].dt.month, df["Data"].dt.day)

In [41]:
df.sample(5)

        Cidade       Data  Vendas  ... Ano_Venda  mes_venda  dia_venda
71   Fortaleza 2019-01-01   41.89  ...      2019          1          1
55   Fortaleza 2019-01-01  214.73  ...      2019          1          1
122     Recife 2019-03-02  235.06  ...      2019          3          2
197      Natal 2019-01-02   10.45  ...      2019          1          2
81   Fortaleza 2019-01-01   10.68  ...      2019          1          1

[5 rows x 10 columns]

In [42]:
#Retornando a data mais antiga
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [44]:
#Calculando a diferença de dias
df["diferenca_dias"] = df["Data"] - df["Data"].min()

In [45]:
df.sample(5)

       Cidade       Data  Vendas  ... mes_venda  dia_venda  diferenca_dias
101    Recife 2019-01-01  172.55  ...         1          1        365 days
157     Natal 2019-01-02  150.17  ...         1          2        366 days
158  Salvador 2019-01-02  183.64  ...         1          2        366 days
27      Natal 2018-07-16  390.00  ...         7         16        196 days
79     Recife 2019-01-01   14.53  ...         1          1        365 days

[5 rows x 11 columns]

In [46]:
#Criando a coluna de trimestre
df["trimestre_venda"] = df["Data"].dt.quarter

In [47]:
df.sample(5)

        Cidade       Data  Vendas  ... dia_venda  diferenca_dias  trimestre_venda
92   Fortaleza 2019-01-01    3.49  ...         1        365 days                1
99      Recife 2019-01-01  136.72  ...         1        365 days                1
169   Salvador 2019-01-02  166.73  ...         2        366 days                1
170      Natal 2019-01-02    9.26  ...         2        366 days                1
52     Aracaju 2018-01-01   14.76  ...         1          0 days                1

[5 rows x 12 columns]

In [48]:
#Filtrando as vendas de 2019 do mês de março
vendas_marco_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)]

In [49]:
vendas_marco_19.sample(20)

        Cidade       Data  Vendas  ... dia_venda  diferenca_dias  trimestre_venda
134   Salvador 2019-03-02  125.90  ...         2        425 days                1
112  Fortaleza 2019-03-02  133.59  ...         2        425 days                1
125     Recife 2019-03-02   37.60  ...         2        425 days                1
114     Recife 2019-03-02   16.82  ...         2        425 days                1
124     Recife 2019-03-02   47.98  ...         2        425 days                1
29       Natal 2019-03-09  646.00  ...         9        432 days                1
130     Recife 2019-03-02   12.36  ...         2        425 days                1
127   Salvador 2019-03-02  240.61  ...         2        425 days                1
117     Recife 2019-03-02   15.42  ...         2        425 days                1
137  Fortaleza 2019-03-02   51.99  ...         2        425 days                1
135   Salvador 2019-03-02    9.95  ...         2        425 days                1
109   Salvador 2019-03-02  124.37  ...         2        425 days                1
127     Recife 2019-03-02   39.56  ...         2        425 days                1
134  Fortaleza 2019-03-02  195.18  ...         2        425 days                1
128     Recife 2019-03-02   38.70  ...         2        425 days                1
124  Fortaleza 2019-03-02   47.98  ...         2        425 days                1
131     Recife 2019-03-02  139.07  ...         2        425 days                1
141   Salvador 2019-03-02    9.08  ...         2        425 days                1
126  Fortaleza 2019-03-02   41.87  ...         2        425 days                1
138     Recife 2019-03-02  150.38  ...         2        425 days                1

[20 rows x 12 columns]